Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: འཇིག་རྟེན་གྱི་དབང་པོ་ཐམས་ཅད་དང་འདྲ་བའི་ནོར་བུ་རིན་པོ་ཆེའི་རྒྱན་དང་ལྡན་པ་དང་། འགྲོ་བ་རྒྱ་མཚོའི་ནོར་བུ་རིན་པོ་ཆེ་རྣམ་པར་ཕྱེ་བ་དང་། ནོར་བུ་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་དྲ་བས་ཀུན་ནས་ཡོག་པའི་གདུགས་དང་། རྒྱལ་མཚན་རབ་ཏུ་བསྒྲེང་བ་དང་། སྒོ་དང་རྟ་བབས་ཐམས་ཅད་ལས་འོད་ཟེར་ཆོས་ཀྱི་དབྱིངས་སུ་རྒྱས་པར་འགེངས་པ་རབ་ཏུ་འབྱུང་བས་རྣམ་པར་མཛེས་པར་བྱས་པ་དང་། ཕྱི་རོལ་གྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་གྱི་སའི་གཞི་སྟེགས་བུ་བརྗོད་དུ་མྱེད་པས་བརྒྱན་པ་དང་། ཕྱོགས་ཀུན་ནས་ཐེམ་སྐས་ཀྱི་ཕྲེང་བ་ནོར་བུ་རིན་པོ་ཆེས་བརྩེགས་ཤིང་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བས་རབ་ཏུ་མཛེས་པར་ཀུན་ནས་གནས་པར་གྱུར་ཏོ། །ཛེ་ཏའི་ཚལ་ཐམས་ཅད་ཀྱང་ཆུ་ཞེང་གབ་པར་ཤིན་ཏུ་ཡངས་ཤིང་རྒྱ་ཆེ་བར་ཀུན་ནས་གནས་པར་གྱུར་ཏེ།
en: As soon as the Bhagavat rested in that meditation, there appeared a kūṭāgāra that was greatly adorned and so vast that it had no end or center, with invincible vajra banners arranged on the ground, arrayed in networks of all kings of precious jewels, filled with petals of flowers made of many jewels, beautified by pillars of beryl, with kings of jewels as an arranged display of ornaments that illuminated the world, having a multitude of excellent jewels, having heaps of precious jewels from the Jambu River, with porches, toraṇas, pinnacles, and windows made of all jewels, adorned by countless pure balconies, with an array of precious jewels that resembled all the lords of worlds, with arrangements of the precious jewels from the world’s oceans, covered with nets of all precious jewels, with upraised parasols and banners, and beautified by gateways and toraṇas emitting light rays that completely filled the realm of phenomena; the external ground was beautified by indescribable daises for the surrounding assembly, and in all directions there were stairways of heaps of jewels and beautifully arranged adornments.

source: སངས་རྒྱས་ཀྱི་མཐུས་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མྱེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་ཀྱང་ཆུ་ཞེང་ཀུན་ཏུ་རྒྱ་ཆེ་ཞིང་ཡངས་པ་དང་། རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་རྒྱན་སྣ་ཚོགས་དང་ལྡན་ཞིང་། སའི་གཞི་ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་བརྗོད་དུ་མྱེད་པས་ཀུན་ནས་གྲུབ་པ་དང་། ནོར་བུ་རིན་པོ་ཆེ་གྲངས་མྱེད་པའི་ར་བས་ཀུན་ནས་བསྐོར་བ་དང་། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཤིང་ཏ་ལའི་ཕྲེང་བས་མཛེས་པར་བརྒྱན་པར་ཀུན་ནས་གནས་པར་གྱུར་ཏོ། །
en: Through the power of the Buddha, there were present buddha realms, to the number of the atoms in countless buddha realms, that were immense and vast in length and breadth, possessed various adornments made of all jewels, had grounds made of an indescribable variety of precious jewels, were encircled by walls of countless precious jewels, and were adorned by lines of palm trees made of various jewels.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ན་སྤོས་ཆུའི་ཆུ་ཀླུང་ཚད་མྱེད་པ་ཀློང་མཐའ་ཡས་པར་འཁྱིལ་པའི་སྤོས་ཀྱི་ཆུས་ཡོངས་སུ་གང་བ། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་མེ་ཏོག་མང་པོ་དང་འདྲེས་པར་གྱུར་ལ་གཡས་ཕྱོགས་སུ་འཁྱིལ་ཅིང་འབབ་པ། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་དབྱིངས་སུ་སྒྲོག་པས་རབ་ཏུ་བརྒྱན་པར་དག་ཀྱང་ཀུན་ནས་གནས་པར་གྱུར་ཏོ། །རིན་པོ་ཆེའི་མེ་ཏོག་པུན་ད་རི་ཀའི་ཕྲེང་བ་དང་། རིན་པོ་ཆེའི་ཤིང་གམ་ཡོ་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་པདྨོ་རབ་ཏུ་རྒྱས་ཤིང་།
en: Those buddha realms were adorned by immeasurable rivers of scented water that were filled with an unceasing volume of scented water that was mixed with many flowers made of a variety of jewels, flowing and turning to the right, and resounding with descriptions of all the qualities of buddhahood.

source: ཤིན་ཏུ་འཕགས་པས་མཛེས་པར་བརྒྱན་པ་དང་། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཁང་པ་བརྩེགས་པའི་ཕྲེང་བ་བསམ་གྱིས་མྱི་ཁྱབ་པ་ནོར་བུ་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་དྲ་བས་ཀུན་ནས་ཡོག་པ་ནོར་བུ་རིན་པོ་ཆེ་གྲངས་མྱེད་པའི་དྲ་བ་ཀུན་ཏུ་སྣང་བས་བརྒྱན་ཅིང་མཛེས་པ་དང་། ནོར་བུ་རིན་པོ་ཆེའི་གཞལ་མྱེད་ཁང་ནོར་བུ་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ་གྲངས་མྱེད་པ་སྤོས་ཐམས་ཅད་ཀྱི་དད་ཀུན་ནས་འབྱུང་བ་བདུག་སྤོས་ཀྱི་སྤྲིན་གྱི་རྒྱན་དང་ལྡན་པ་དག་ཀྱང་ཀུན་ནས་གནས་པར་གྱུར་ཏོ། །རིན་པོ་ཆེའི་རྒྱལ་མཚན་གྲངས་མྱེད་པ་དང་། གོས་ཀྱི་རྒྱལ་མཚན་དང་། བ་དན་གྱི་རྒྱལ་མཚན་དང་། རིན་པོ་ཆེའི་སྣམ་བུའི་རྒྱལ་མཚན་དང་། མེ་ཏོག་གི་རྒྱལ་མཚན་དང་། རྒྱན་གྱི་རྒྱལ་མཚན་དང་། ཕྲེང་བའི་རྒྱལ་མཚན་དང་། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་དྲིལ་བུའི་རྒྱལ་མཚན་དང་། རིན་པོ་ཆེའི་རྒྱལ་བའི་གདུགས་ཀྱི་རྒྱལ་མཚན་དང་། ནོར་བུ་རིན་པོ་ཆེ་སྣང་བས་ཀུན་ཏུ་རྒྱས་པར་འགེངས་པའི་རྒྱལ་མཚན་དང་། ནོར་བུ་རིན་པོ་ཆེའི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་མཚན་གྱི་འཁོར་ལོའི་དབྱངས་རབ་ཏུ་སྒྲོག་པའི་རྒྱལ་མཚན་དང་། ནོར་བུ་རིན་པོ་ཆེའི་རྒྱལ་པོ་སེང་གེ་ཡིད་དུ་འོང་བའི་རྒྱལ་མཚན་དང་། ནོར་བུ་རིན་པོ་ཆེའི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྔོན་གྱི་སྦྱོར་བ་རབ་ཏུ་སྒྲོག་པའི་རྒྱལ་མཚན་དང་། ནོར་བུ་རིན་པོ་ཆེའི་རྒྱལ་པོ་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རབ་ཏུ་སྣང་བའི་རྒྱལ་མཚན་དང་།
en: There were rows of precious white lotus flowers, precious trees beautifully adorned by the blossoms of superior lotuses made from all jewels, rows of countless kūṭāgāras made of various jewels covered in shining networks of every kind of precious jewel, countless aerial palaces made of precious jewels adorned with all precious jewels, the aroma of countless incenses spread everywhere, and the adornment of clouds of incense, countless banners of jewels, banners of cloth, banners that were flags, banners with streamers of jewels, banners with flowers, banners with adornments, banners with garlands, banners with bells of various jewels, banners that were parasols of kings of jewels, banners of precious jewels with pervading radiance, banners of kings of precious jewels that resounded with the wheel of the names of all the tathāgatas, banners of delightful lions made of the kings of precious jewels, banners of the kings of precious jewels that proclaimed the past practices of all the tathāgatas, and banners of the kings of precious jewels that illuminated the entire realm of phenomena, and all directions were adorned with every kind of adorning banner.

source: རྒྱལ་མཚན་གྱི་རྒྱན་རྣམ་པར་ཕྱེ་བ་ཐམས་ཅད་ཕྱོགས་ཀུན་ནས་རྒྱན་ཏུ་གྱུར་པ་དག་ཀྱང་ཀུན་ནས་གནས་པར་གྱུར་ཏོ། །ཛེ་ཏའི་ཚལ་གྱི་ནམ་མཁའི་དབྱིངས་ཐམས་ཅད་ཀྱང་ལྷའི་གཞལ་མྱེད་ཁང་གི་སྤྲིན་བསམ་གྱིས་མྱི་ཁྱབ་པས་བརྒྱན་པར་ཀུན་ནས་གནས་པར་གྱུར་ཏེ།
en: Clouds of countless aerial palaces of devas adorned the entire expanse of the sky above Jetavana.

source: ཛེ་ཏའི་ཚལ་ཉིད་ཀྱང་སྤོས་སྣ་ཚོགས་ཀྱི་ཤིང་གྲངས་མྱེད་པའི་སྤྲིན་གྱིས་ཀུན་ནས་ཡོག་ཅིང་བརྒྱན་པ་དང་།
en: Jetavana was adorned and covered by a cloud of countless trees of various kinds of incense.

source: བརྗོད་དུ་མྱེད་པའི་རྒྱན་སྣ་ཚོགས་དང་ལྡན་པའི་རི་རབ་ཀྱིས་ཀུན་ནས་འཁོར་ཅིང་རྒྱན་པ་དང་།
en: It was adorned and encircled by Sumeru Mountains that possessed indescribable adornments.

source: རོལ་མོ་བརྡུང་བ་དང་། དཀྲོལ་བ་བརྗོད་དུ་མྱེད་པའི་སྤྲིན་ལས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་བསྟོད་པའི་དབྱངས་དང་ང་རོ་སྙན་པ་འབྱུང་བས་ཀུན་ནས་བརྒྱན་པ་དང་།
en: It was adorned by the beautiful voices and sounds of the praises of all tathāgatas that came from indescribable clouds of musical instruments being played and beaten.

source: རིན་པོ་ཆེའི་པདྨོ་བརྗོད་དུ་མྱེད་པའི་སྤྲིན་གྱིས་ཀུན་ནས་ཡོག་ཅིང་བརྒྱན་པ་དང་།
en: It was adorned by a covering of clouds of indescribable precious lotuses.

source: རིན་པོ་ཆེའི་སེང་གེའི་ཁྲི་བརྗོད་དུ་མྱེད་པའི་སྟེང་ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེའི་སྟན་བཏིང་བ་ལ། །བྱང་ཆུབ་སེམས་དཔའ་འཁོད་ཅིང་དེ་བཞིན་གཤེགས་པ་ལ་བསྟོད་པའི་སྒྲ་དབྱངས་སྙན་པ་འབྱིན་པའི་སྤྲིན་གྱི་ཀུན་ནས་བརྒྱན་པ་དང་།
en: There were indescribable precious lion thrones on which were precious cushions made of divine materials, on which the bodhisattvas were seated, and which were adorned by clouds that emitted beautiful voices that praised the tathāgatas.

source: ལྷའི་དབང་པོ་བརྗོད་དུ་མྱེད་པའི་གཟུགས་བརྙན་མངོན་པར་འབྱུང་བའི་ནོར་བུ་རིན་པོ་ཆེའི་འབྲུའི་སྤྲིན་གྱིས་ཀུན་ནས་བརྒྱན་པ་དང་།
en: It was adorned by clouds of grains that were precious jewels that formed indescribable images of lords of the worlds.

source: མུ་ཏིག་དཀར་པོའི་དྲ་བའི་སྤྲིན་བརྗོད་དུ་མྱེད་པས་ཀུན་ནས་བརྒྱན་པ་དང་།
en: It was adorned by indescribable clouds of networks of white pearls.

source: མུ་ཏིག་དཀར་པོའི་ཁང་པ་བརྩེགས་པའི་སྤྲིན་བརྗོད་དུ་མྱེད་པས་ཀུན་ནས་ཡོག་ཅིང་བརྒྱན་པ་དང་།
en: It was adorned by a covering of indescribable clouds of kūṭāgāras made of red pearls.

source: རྡོ་རྗེ་ལྟ་བུར་སྲ་བའི་མུ་ཏིག་གི་སྤྲིན་བརྗོད་དུ་མྱེད་པའི་ཆར་མངོན་པར་འབབ་པས་རབ་ཏུ་བརྒྱན་པར་ཀུན་ནས་གནས་པར་གྱུར་ཏོ། །
en: It was adorned by an indescribable rainfall from clouds of pearls that were as hard as vajras.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why was this?

source: དེ་ནི་དེ་བཞིན་གཤེགས་པའི་དགེ་བའི་རྩ་བ་བསམ་གྱིས་མི་ཁྱབ་པའི་ཕྱིར་རོ། །
en: It was because of the inconceivable roots of merit of a tathāgata.

source: དེ་བཞིན་གཤེགས་པའི་ཆོས་དཀར་པོའི་ཚོགས་བསམ་གྱིས་མི་ཁྱབ་པའི་ཕྱིར་རོ། །
en: It was because of the inconceivable good qualities of a tathāgata.

source: དེ་བཞིན་གཤེགས་པའི་ཁྱུ་མཆོག་གི་མཐུ་དང་། བྱིན་གྱི་རླབས། བསམ་གྱིས་མྱི་ཁྱབ་པའི་ཕྱིར་རོ། །
en: It was because of the inconceivable sovereign power and blessing of a tathāgata.

source: དེ་བཞིན་གཤེགས་པའི་སྐུ་གཅིག་གིས་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་རྒྱས་པར་འགེངས་པ་རྣམ་པར་འཕྲུལ་པ་བསམ་གྱིས་མྱི་ཁྱབ་པའི་ཕྱིར་རོ།
en: It was because of a tathāgata’s inconceivable miraculous manifestations whereby his one body could pervade all world realms.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྐུ་གཅིག་ཏུ་ཞུགས་པས། སངས་རྒྱས་ཀྱི་ཞིང་རྣམ་པར་ཕྱེ་བ་ཐམས་ཅད་ལ་ཡང་དག་པར་གཞོལ་བའི་བྱིན་གྱི་རླབས་ཡོངས་སུ་སྟོན་པ་བསམ་གྱིས་མྱི་ཁྱབ་པའི་ཕྱིར་རོ། །
en: It was because of the inconceivable display of the spiritual power through which all the tathāgatas could enter one body that appears throughout the entire array of buddha realms.

source: དེ་བཞིན་གཤེགས་པ་རྣམས་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་གཅིག་ལ་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་ཀྱི་གཟུགས་བརྙན་རྣམ་པར་དམྱིགས་པར་ཡོངས་སུ་སྟོན་པར་མཛད་པ་བསམ་གྱིས་མྱི་ཁྱབ་པའི་ཕྱིར་རོ། །
en: It was because of the inconceivable manifestations of the tathāgatas through which they can show the perceivable image of the entire realm of phenomena within a single atom.

source: དེ་བཞིན་གཤེགས་པ་རྣམས་པ་སྤུའི་བུ་ག་གཅིག་ཏུ་སྔོན་གྱི་མཐའི་དེ་བཞིན་གཤེགས་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ཡོངས་སུ་སྟོན་པར་མཛད་པ་བསམ་གྱིས་མྱི་ཁྱབ་པའི་ཕྱིར་རོ། །
en: It was because of the inconceivable manifestations of the tathāgatas through which they can show the entire succession of tathāgatas of the past within a single pore.

source: དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་འོད་ཟེར་གཅིག་གི་སྒོ་ནས་འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པ་སྣང་བར་འགྱུར་བ་བསམ་གྱིས་མྱི་ཁྱབ་པའི་ཕྱིར་རོ། །
en: It was because of the tathāgatas’ inconceivable ability to illuminate infinite world realms with a single ray of light.

source: དེ་བཞིན་གཤེགས་པ་རྣམས་པ་སྤུའི་རྩེ་མོ་གཅིག་ལས་སྤྲུལ་པའི་སྤྲིན་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱིས་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་རྒྱས་པར་འགེངས་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་ཕྱིར་རོ། །
en: It was because of the tathāgatas’ inconceivable ability to pervade all buddha realms, which are as numerous as the atoms that comprise all world realms, with a cloud of emanations from a single body hair.

source: དེ་བཞིན་གཤེགས་པ་རྣམས་པ་སྤུའི་སྒོ་གཅིག་ནས་འཇིག་རྟེན་གྱི་ཁམས་འདུ་བ་དང་། འཇིག་པའི་བསྐལ་པ་ཡོངས་སུ་སྟོན་པ་བསམ་གྱིས་མྱི་ཁྱབ་པའི་ཕྱིར་རོ། །
en: It was because of the tathāgatas’ inconceivable ability to reveal the kalpas of the creation and destruction of world realms from a single body hair.

source: ཇི་ལྟར་ཛེ་ཏའི་ཚལ་དེ་ལྟ་བུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པས་ཡོངས་སུ་དག་པར་ཀུན་ནས་གནས་པར་གྱུར་པ་དེ་བཞིན་དུ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཆོས་ཀྱི་དབྱིངས་ཀྱིས་ཀླས་པ། ནམ་མཁའི་མཐས་གཏུགས་པ་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་དག་པར་ཀུན་ནས་གནས་ཤིང་རབ་ཏུ་བརྒྱན་པ་དང་། ཤིན་ཏུ་སྤུད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུས་ཡོངས་སུ་རྒྱས་པ་དང་། ཛེ་ཏའི་ཚུལ་དུ་ཡང་དག་པར་གཞོལ་བ་དང་། བྱང་ཆུབ་སེམས་དཔས་ཡོངས་སུ་རྒྱས་པ་དང་། དེ་བཞིན་གཤེགས་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་ཤིན་ཏུ་རྣམ་པར་གནས་པ་དང་རྒྱན་ཐམས་ཅད་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་འབབ་པ་དང་། རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་འོད་ཀྱིས་རབ་ཏུ་སྣང་བ་དང་། རིན་པོ་ཆེ་སྣ་ཚོགས་ཐམས་ཅད་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་འབབ་པས་བརྒྱན་པ་དང་། ཞིང་ཐམས་ཅད་ཀྱི་རྒྱན་གྱི་སྤྲིན་གྱིས་ཀུན་ནས་ཡོག་པར་བརྒྱན་པ་དང་། ལྷ་རྫས་ཀྱི་ལུས་ཐམས་ཅད་སྤྲིན་གྱི་ཆར་རབ་ཏུ་འབབ་པས་བརྒྱན་པ་དང་། མེ་ཏོག་སྣ་ཚོགས་ཐམས་ཅད་ཀྱི་སྤྲིན་ཤིན་ཏུ་རྒྱས་པའི་ལྷུན་གྱིས་ཀུན་ཏུ་རྒྱས་ཤིང་བརྒྱན་པ་དང་།
en: Just as Jetavana was in this way a buddha realm and was completely purified by being a pure realm, in that same way the world realms in the ten directions to the limits of the realm of phenomena, to the limits of space, were also completely purified, adorned, beautified, and with emanated bodies of tathāgatas, and had become similar to Jetavana.

source: གོས་ཐམས་ཅད་ཀྱི་ཤིང་གི་སྤྲིན་གྱི་མཛོད་ནས་གོས་ཁ་དོག་སྣ་ཚོགས་སུ་མཛེས་པའི་ཆར་རབ་ཏུ་འབབ་པས་བརྒྱན་པ་དང་། ཕྲེང་བ་དང་ལྡ་ལྡི་དང་སེ་མོ་དོའི་རྒྱན་ཐམས་ཅད་ཀྱི་སྤྲིན་གྱི་ཆར་རྒྱུན་མི་ཆད་པར་མངོན་པར་འབབ་པས་བརྒྱན་པ་དང་། སྤོས་སྣ་ཚོགས་ཀྱི་བདུག་སྤོས་ཕྱོགས་ཀུན་ནས་འཐུལ་བའི་སྤྲིན་དང་ན་བུན་གྱི་ཆར་ཐམས་ཅད་ཀྱི་ལུས་ཀྱི་དབྱིབས་ལྟར་མངོན་པར་འབབ་པས་བརྒྱན་པ་དང་། རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་མེ་ཏོག་གི་དྲ་བའི་སྤྲིན་ལས་རིན་པོ་ཆེའི་རྒྱལ་པོའི་ཕྱེ་མ་ཞིབ་བུའི་ཆར་རྒྱུན་མྱི་འཆད་པར་རབ་ཏུ་འབབ་པ་དང་། རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་རྒྱལ་མཚན་དང་བ་དན་གྱི་སྤྲིན་ལྷའི་བུ་མོའི་ལག་ན་ཁྱེར་བ་ནམ་མཁའི་དབྱིངས་ཀུན་ཏུ་རྒྱུ་ཞིང་འཁོར་བས་བརྒྱན་པ་དང་། རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་པདྨོ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་འདབ་མའི་དཀྱིལ་འཁོར་ཅན་ཆུ་བ་མཐོན་པོ་དང་ལྡན་པའི་ཟེ་བ་ལ་རོལ་མོ་བཀོད་པ་ཀུན་ནས་སྒྲ་འབྱིན་ཅིང་དབྱངས་སྙན་པར་སྒྲོག་པས་བརྒྱན་པ་དང་། རིན་པོ་ཆེའི་འབྲུ་སྣ་ཚོགས་ཀྱི་དྲ་བ་དང་། རིན་པོ་ཆེ་སེང་གེའི་དྲ་བ་སྣ་ཚོགས་རྣམ་པ་ཐ་དད་པའི་ཕྲེང་བ་དང་། སེ་མོ་དོས་བརྒྱན་པར་ཀུན་ནས་གནས་ཤིང་སྣང་བར་གྱུར་ཏོ། །དེ་ལྟར་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་ཆེན་པོ་སེང་གེ་རྣམ་པར་བསྒྱིངས་པ་དེ་ལ་ཉམས་པར་བཞག་མ་ཐག་ཏུ། །
en: They were filled with bodhisattvas; had ocean-like assemblies of followers of tathāgatas; had rainfalls from clouds made of every kind of adornment; were completely illuminated by the lights of all jewels; were adorned by rainfall from clouds made of the entire variety of jewels; were adorned by a covering of clouds made of the adorning features of all realms; were adorned by rainfalls of every kind of divine material; were adorned by a profusion of clouds of every kind of flower; were adorned by a beautiful rainfall of clothes of every color falling from a treasure of clouds of trees of every kind of clothing; were adorned by a continuous rainfall from clouds made of every kind of garland, tassel, and string of beads; were adorned by a rain from masses of clouds as extensive as the universe that were made of various kinds of incense and perfume that pervaded all the directions; were adorned by a continuous rain of a fine powder of networks of jewels from clouds of networks of flowers made from every kind of jewel; were adorned by clouds of banners and flags made of every kind of jewel and held in the hands of divine maidens who moved to and fro throughout the extent of space; were adorned with a variety of lotuses made from all jewels and with circles of precious petals, tall stems, and pericarps that resounded with the beautiful sounds of music; and were adorned with nets of disks of every kind of jewel, nets of lions made of jewels, and various kinds of garlands and strings of beads.

source: དེའི་ཚེ་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མྱེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་ཕ་རོལ་གྱི་འཇིག་རྟེན་གྱི་ཁམས་གསེར་གྱི་སྤྲིན་སྒྲོན་མའི་རྒྱལ་མཚན་ཞེས་བྱ་བ་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་དཔལ་གྱི་གཟི་བརྗིད་རྒྱལ་པོའི་སངས་རྒྱས་ཀྱི་ཞིང་ནས་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་སྣང་བའི་སྨོན་ལམ་གྱི་གཙུག་གི་འོད་ཟེར་སྣང་བ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མྱེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བསྙེད་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་དེས་གནང་ནས་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་དེ་ནས་འཕགས་ཏེ། ནམ་མཁའི་དབྱིངས་རྒྱན་སྣ་ཚོགས་ཀྱི་སྤྲིན་གྱིས་བརྒྱན་པ་དང་། ལྷ་རྫས་ཀྱི་མེ་ཏོག་གི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། ལྷ་རྫས་ཀྱི་སྤོས་ཀྱི་སྤྲིན་གྱི་ཆར་རབ་ཏུ་དགྱེ་བ་དང་། ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེའི་པདྨོའི་སྤྲིན་གྱི་ཆར་མངོན་པར་གཏོར་བ་དང་། ལྷ་རྫས་ཀྱི་ཕྲེང་བའི་སྤྲིན་གྱི་ཆར་རབ་ཏུ་བཏང་བ་དང་། ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེའི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། ལྷ་རྫས་ཀྱི་རྒྱན་གྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དགྱེ་བ་དང་། ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེའི་གདུགས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་བསྒྲུབ་པ་དང་། ཁ་དོག་སྣ་ཚོགས་རྣམ་པ་ཐ་དད་ཅིང་ཤིན་ཏུ་ཕྲ་བའི་ལྷ་རྫས་ཀྱི་གོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེའི་རྒྱལ་མཚན་དང་། བ་དན་གྱི་སྤྲིན་ནམ་མཁའི་དབྱིངས་ལས་བྱིན་གྱིས་བརླབ་པ་དང་། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་སྤྲིན་གྱི་རྒྱན་ཡིད་དུ་འོང་བས་ནམ་མཁའི་དབྱིངས་རྒྱས་པར་འགེངས་པར་བྱེད་ཅིང་། མྱི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་ན་བ་དེར་ལྷགས་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ།
en: In that way, as soon as the Bhagavat rested in the samādhi called the gaping lion, at that time, in the eastern direction, beyond an ocean of world realms as numerous as the atoms in countless buddha realms, there was the world realm Kanaka­megha­pradīpa­dhvajā, the Tathāgata Vairocana­śrī­tejorāja’s buddha realm, where the bodhisattva Vairocana­praṇidhāna­nābhi­raśmi­prabha, together with bodhisattvas to the number of atoms in countless buddha realms, with the permission of the Bhagavat, rose up from that ocean of the assembly of followers, came to the Sahā world realm, and adorned the sky with clouds of various kinds of adornments: clouds of divine flowers from which a rain of flowers fell, clouds of divine perfume from which a rain of perfume was released, clouds of divine jewel lotuses from which a rain of lotuses was scattered, clouds of divine garlands from which a rain of garlands was produced, clouds of divine jewels from which a rain of jewels fell, clouds of divine jewelry from which a rain of jewelry fell, clouds of divine precious parasols from which a rain of parasols was produced, clouds of divine flowers from which a rain of flowers fell, clouds of various kinds of fine divine clothing in different colors from which a rain of clothing fell, clouds of divine precious banners and flags that stood in the sky, and an array of clouds of every kind of jewel that filled the sky.

source: འཁོར་དང་བཅས་པས་བཅོམ་ལྡན་འདས་ལ་ཕྱག་འཚལ་ནས་ཤར་ཕྱོགས་སུ་བརྟེན་ཏེ། ཁང་པ་བརྩེགས་པ་རྒྱན་ཀུན་དང་ལྡན་ཞིང་ནོར་བུ་རིན་པོ་ཆེའི་དྲ་བས་ཀུན་ནས་ཁྱབ་པ་དང་། སེང་གེའི་ཁྲི་ནོར་བུ་རིན་པོ་ཆེ་ཕྱོགས་རབ་ཏུ་སྣང་བའི་པདྨོའི་སྙིང་པོ་ཅན་དག་མངོན་པར་སྤྲུལ་ནས་ནོར་བུ་རིན་པོ་ཆེ་ཡིད་བཞིན་གྱི་རྒྱལ་པོའི་དྲ་བའི་རྒྱན་གྱིས་ཀུན་ནས་བརྒྱན་པའི་བྱང་ཆུབ་སེམས་དཔའི་ལུས་སུ་བྱིན་གྱིས་བརླབས་ནས་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འཁོད་དོ། །
en: Together with his entourage, he approached the Bhagavat, bowed to the Bhagavat, and in the eastern direction emanated perfectly adorned kūṭāgāras that were covered with a net of precious jewels, each containing a lion throne and a lotus made of precious jewels that shined light in all directions, and he and his entourage seated themselves cross-legged upon the lotuses, their bodhisattva bodies adorned with a network of the kings of precious wish-fulfilling jewels.

source: ལྷོ་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མྱེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་ཕ་རོལ་གྱི་འཇིག་རྟེན་གྱི་ཁམས་རྡོ་རྗེ་རྒྱལ་མཚན་གྱི་སྙིང་པོ་ཞེས་བྱ་བ་དེ་བཞིན་གཤེགས་པ་དཔལ་གྱི་སྙིང་པོ་ཀུན་ནས་སྣང་བའི་རྒྱལ་པོའི་སངས་རྒྱས་ཀྱི་ཞིང་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་ཀྱི་ཤུགས་ཐུབ་པར་དཀའ་བའི་རྒྱལ་པོ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མྱེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་དེས་གནང་ནས་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་དེ་ནས་འཕགས་ཏེ།
en: In the southern direction, beyond an ocean of world realms as numerous as the atoms in countless buddha realms, there was the world realm Vajra­sāgara­garbhā, the Tathāgata Samantāvabhāsa­śrī­garbha­rāja’s buddha realm, where the bodhisattva Duryodhana­vīrya­vega­rāja, together with bodhisattvas to the number of atoms in countless buddha realms, with the permission of the Bhagavat, rose up from that ocean of the assembly of followers and came to the Sahā world realm.

source: འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་ཐམས་ཅད་སྤོས་ཀྱི་ལྡ་ལྡི་དང་དྲ་བས་ཀུན་ཏུ་འབྲེལ་བར་བྱིན་གྱིས་བརླབ་པ་དང་།
en: They manifested a network of tassels of every perfume that covered all the oceans of world realms.

source: སངས་རྒྱས་ཀྱི་ཞིང་འབྱམ་ཀླས་པ་ཐམས་ཅད་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ལྡ་ལྡི་དང་དྲ་བ་ཆེན་པོས་ཀུན་ཏུ་འབྲེལ་བར་བྱིན་གྱིས་བརླབ་པ་དང་།
en: They manifested a network of tassels of strings of every kind of jewel extending throughout all infinite buddha realms.

source: སངས་རྒྱས་ཀྱི་ཞིང་གི་རྒྱུད་ཐམས་ཅད་མེ་ཏོག་ཐམས་ཅད་ཀྱི་ལྡ་ལྡི་དང་། ཕྲེང་བའི་དྲ་བས་ཀུན་ཏུ་འབྲེལ་བར་བྱིན་གྱིས་བརླབ་པ་དང་།
en: They manifested a network of tassels and garlands made of every kind of flower that existed throughout all successive buddha realms.

source: སངས་རྒྱས་ཀྱི་ཞིང་གི་འཁོར་ཐམས་ཅད་ཕྲེང་བ་དང་ལྡ་ལྡི་དང་། སེ་མོ་དོའི་དྲ་བས་ཀུན་ནས་འབྲེལ་བར་བྱིན་གྱིས་བརླབ་པ་དང་།
en: They manifested a network of garlands, tassels, and strings of beads that connected all buddha realms.

source: སངས་རྒྱས་ཀྱི་ཞིང་གི་དཀྱིལ་འཁོར་ཐམས་ཅད་འོག་གི་གཞི་རྟེན་རྡོ་རྗེ་ཐམས་ཅད་ཀྱི་ཕྲེང་བས་ཡོངས་སུ་གཟུང་བར་བྱིན་གྱིས་བརླབ་པ་དང་།
en: They manifested a network of chains of vajras that holds the ground beneath all the disks of buddha realms.

source: སངས་རྒྱས་ཀྱི་ཞིང་གི་ཚུལ་ཐམས་ཅད་ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་དྲ་བས་ཀུན་ནས་འབྲེལ་བར་བྱིན་གྱིས་བརླབ་པ་དང་།
en: They manifested the way that all buddha realms possess networks of various kinds of precious jewels.

source: འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་གོས་སྣ་ཚོགས་ཀྱི་ལྡ་ལྡིས་ཀུན་ནས་ཡོངས་སུ་བླངས་ཤིང་གཟུང་བར་བྱིན་གྱིས་བརླབ་པ་དང་།
en: They manifested all world realms having acquired and possessing tassels of various kinds of cloth.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ལུས་ཀྱི་ཕྲེང་བ་དང་ལྡ་ལྡི་མང་པོའི་དྲ་བས་ཀུན་ནས་འབྲེལ་བར་མངོན་པར་བསྒྲུབ་པ་དང་། ཞིང་ཐམས་ཅད་ནོར་བུ་རིན་པོ་ཆེ་དཔལ་གྱི་འོད་ཟེར་གྱི་ལྡ་ལྡི་དང་། ཕྲེང་བའི་དྲ་བས་ཀུན་ནས་འབྲེལ་བར་བྱིན་གྱིས་བརླབ་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་རིན་པོ་ཆེ་རྣམ་པར་སྣང་བའི་ལྡ་ལྡི་དང་།
en: They manifested all buddha realms being possessed of networks of many tassels and garlands of a variety of jewels, and all realms possessing a network of tassels and garlands made of the light rays of glorious precious jewels.

source: དྲ་བས་ཀུན་ཏུ་འབྲེལ་བར་བྱིན་གྱིས་བརླབ་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་གཞི་ནོར་བུ་རིན་པོ་ཆེ་སེང་གེ་ཡིད་དུ་འོང་བའི་ཕྲེང་བ་དང་། ལྡ་ལྡིའི་དྲ་བས་ཡོངས་སུ་གཟུང་བར་བྱིན་གྱིས་བརླབ་པ་བྱེད་ཅིང་། མྱི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་ན་བ་དེར་ལྷགས་ནས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་དོང་སྟེ།
en: And they manifested the ground of all world realms having a network of tassels and garlands of precious jewels and beautiful lion images.

source: འཁོར་དང་བཅས་པས་བཅོམ་ལྡན་འདས་ལ་ཕྱག་འཚལ་ནས། ལྷོ་ཕྱོགས་སུ་བརྟེན་ཏེ། ནོར་བུ་རིན་པོ་ཆེ་འགྲོ་བ་ལ་རྣམ་པར་སྣང་བའི་ཁང་པ་བརྩེགས་པ་དང་། སེང་གེའི་ཁྲི་ནོར་བུ་རིན་པོ་ཆེ་ཕྱོགས་ཀུན་ཏུ་རྣམ་པར་སྣང་བའི་པདྨོའི་སྙིང་པོ་ཅན་དག་མངོན་པར་སྤྲུལ་ཏེ། རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་མེ་ཏོག་གི་དྲ་བའི་རྒྱན་གྱིས་ཀུན་ནས་བརྒྱན་པའི་བྱང་ཆུབ་སེམས་དཔའི་ལུས་སུ་བྱིན་གྱིས་བརླབས་ནས་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འཁོད་དོ། །ནུབ་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མྱེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་ཕ་རོལ་གྱི་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེའི་རི་རབ་རྣམ་པར་སྣང་བའི་རྒྱལ་མཚན་མར་མྱེ་ཞེས་བྱ་བ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཡེ་ཤེས་སྒྲོན་མའི་སངས་རྒྱས་ཀྱི་ཞིང་ནས་བྱང་ཆུབ་སེམས་དཔའ་དཔལ་ཀུན་ནས་འཕགས་པའི་གཟི་བརྗིད་ཅེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའ་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་བརྗོད་དུ་མྱེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་དེས་གནང་ནས་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་དེ་ནས་འཕགས་ཏེ། ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་བདུག་སྤོས་ཁ་དོག་སྣ་ཚོགས་དང་། དྲི་སྣ་ཚོགས་སུ་ལྡན་པའི་རི་རབ་ཀྱི་སྤྲིན་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མྱེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱིས་རྒྱས་པར་དགང་བ་དང་། ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་སྤོས་ཁ་དོག་སྣ་ཚོགས་དང་ལྡན་པའི་རི་རབ་ཀྱི་སྤྲིན་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མྱེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱིས་རྒྱས་པར་དགང་བ་དང་། ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་བདུག་སྤོས་ཁ་དོག་དང་དྲི་དུ་མར་ལྡན་པའི་རི་རབ་ཀྱི་སྤྲིན་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མྱེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱིས་རྒྱས་པར་དགང་བ་དང་། ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་སྤོས་ཁ་དོག་སྣ་ཚོགས་དང་ལྡན་པའི་རི་རབ་ཀྱི་སྤྲིན་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མྱེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱིས་རྒྱས་པར་དགང་བ་དང་། ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་ནོར་བུ་རིན་པོ་ཆེའི་རྒྱལ་པོ་མདངས་འབྱུང་བས་ཐམས་ཅད་ཀྱི་རྡུལ་གྱི་ཁ་དོག་དང་འདྲ་བའི་རི་རབ་ཀྱི་སྤྲིན་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མྱེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱིས་རྒྱས་པར་དགང་བ་དང་།
en: Together with his entourage, he approached the Bhagavat, bowed to the Bhagavat, and in the southern direction emanated kūṭāgāras made of precious jewels that illuminated the world, each containing a lion throne and a lotus made of precious jewels, which shined light into all directions, and he and his entourage seated themselves cross-legged upon the lotuses, their bodhisattva bodies adorned with a network of flowers made from every kind of jewel.
